import nltk
import codecs
import time

nltk.download('punkt')
#var =input("enter the bangla sentence:   ")
start=time.time()

file_content = codecs.open('Demo.txt','r','utf8')
output=file_content.read()

arr=[' ','অ','আ','ই','ঈ','উ','ঊ','ঋ','এ','ঐ','ও','ঔ','ক','খ','গ','ঘ','ঙ','চ','ছ','জ','ঝ','ঞ','ট','ঠ','ড','ঢ','ণ','ত','থ','দ','ধ','ন','প',
     'ফ','ব','ভ','ম','য','র','ল','শ','ষ','স','হ','ড়','ঢ়','য়','ৎ','ং','ঃ','ঁ','া','ি','ী','ু','ূ','ৃ','ৄ','ে','ৈ','ো','ৌ','‍্য','‍্র','্','ঽ','র্‍',
     '৺','ঀ','০','১','২','৩','৪','৫','৬','৭','৮','৯','+','-',',',':','"','_','!','/','?','%','#','@','-','*','(',')',
     '{','}','[',']',';','।','.','৳',' ~','\n','়','\r','^','∑','√','÷','×','∠','∴','≠']

co=output.split("।") 

def split(tok):
    return [char for char in tok] 

for i in range(len(co)):
  tok = nltk.word_tokenize(co[i])
  #print(tok)
  letter = split(output)
#print(letter) 

character=[]

for j in range(len(letter)):
  for k in range(len(arr)):
    if (letter[j] == arr[k]): 
        character.append(letter[j])

        
      
#print(character)
  
def convert(s): 
  
    # initialization of string to "" 
    new = " " 
  
    # traverse in the string  
    for x in s: 
        new += x
        #print(x)
        #print(new)
  
    # return string  
    return new
#print(convert(character))


with open('Bangla.txt', 'a') as f:
    print(convert(character), file=f)
file_content = codecs.open('Bangla.txt','r','utf8')
output=file_content.read()
co=output.split("।") 
#print(co)
for i in range(len(co)):
  tok = nltk.word_tokenize(co[i])
  print(tok)

  PR  = ['আমি', 'তুমি', 'সে', 'তারা', 'ছেলে','আমার','তিনি','তোমার','আমাকে','তার','তাদের','তোমরা','তোমাদের','যে','কোন',
         'যা','যারা','তাদেরকে','আমাদের','আপনার','আমরা','তোমাদেরকে','তাকে','আপনি','তাঁর','পালনকর্তা','কিছু','তুমি','কে',
         'তা','পালনকর্তার','এটা','কেউ','এই','নয়','যার','নিজেদের','যিনি','তিনিই','আপনাকে','নিজের','তারাই','যাদের','কেন',
         'এইসব','অন্য','তাঁরই','তুমিই', 'এগুলোর', 'অন্যতম ', 'ঐসব', 'এগুলোকে','সেগুলোর','আপনিই','তোর','এদেরকে',
         'উভয়কে' ,'সবকিছুই','কোনই','সমূহে','']
  
  OB  = ['ভাত','গাড়ি', 'ঘুরতে','চকলেট','স্কুলে','সবসময়','কথা','বই','রোজ','আজ','বাড়ি','ঘুম','আজ','ট্রেনে',
         'বাড়ি','সারাদিন','রোজ','কলম','মাঠে','শীতে','দীর্ঘ','সময়','ধরে','নামটি','জীবনে','মাকে','ছবি','গান',
         'নাচ','পড়ালেখায়','মনযোগ','দিয়ে','পড়াশোনা','শরবত','তরকারি','ডাল','ক্লাসে','দুষ্টামি','গোসল','কাল','ফেরত',
         'চা','নাম','টাকা','ঋণ','মাছ','পুকুরে','মানুষ','জীবনেও','কাজ','বিরত','সদা','মানুষের','শরীর','কবি','ডাক্তার',
         'কবিতা','কলকাতায়','চিঠি','গতকাল','মারা','গোলাপ','ফুল','নাজিয়া','আল্লাহ','আল্লাহর','সৃষ্টি','দান','বিশ্বাস','কথা','পথ',
         'স্থাপন','করব','আল্লাহকে','বিষয়ে','মনে','গ্রহণ','লোক','সব','উত্তম','সম্প্রদায়','ব্যক্তি','অবতীর্ণ','পূর্বে','ব্যাপারে','অস্বীকার',
         'মানুষের','নিদর্শন','রসূল','রসূলের','প্রদর্শন','নভোমন্ডল','কর্তব্য', 'লাভের', 'কথায়', 'রসূলগণকে', 'অব্যাহতি', ' রকম', 
         ' ত্যাগ', 'সন্তানদেরকে', 'ভ্রমণ', 'রচনা', 'বন্ধুরূপে', 'পরিবারবর্গকে', 'উদাহরণ', 'বিশ্বজগতের', 'বনী', 'গ্রন্থের', 'পর্বতমালা',
         'রক্ত','তওরাত', 'মুমিনদেরকে', 'সিদ্ধান্ত', 'মহিমা', 'শ্রেষ্ঠত্ব', 'আজকের', 'স্থলে', 'অপরাধীদের', 'কওম', 'অনুধাবন', 'বস্তুকে',
         'পরহেযগারদের','দুনিয়াতে', 'প্রচুর', 'যালেম', 'সৃষ্টির', 'সময়ের', 'সুসংবাদদাতা', 'দিনকে', 'মাবুদ', 'গোনাহগার', 'আবৃত্তি',
         'সমুদ্রে', 'ব্যক্তিকে','ভিন্ন', 'হাজার', 'বাণী', 'পিতার', 'বাহিনী', 'পথপ্রদর্শন', 'সাধন', 'জিজ্ঞাসাবাদ', 'আখেরাতে',  'মৃত্তিকা',
         'বিস্তারিত','উক্তি','মতবিরোধ', 'দুনিয়ার', 'বান্দার','ইউসুফের','ভুমন্ডলে','হস্ত ','সেজদায়','ইসহাক','ফসল','নিদর্শনসমূহ',
         'চিন্তা-ভাবনা', 'উত্তরাধিকারী', 'ব্যবহার', 'শস্য','অধিবাসী', 'সূরা', 'কাল','আদায়','নদী','দিবসকে', 'ধর্মে', 'শহরে', 'ইহুদী', 
         'মাস', 'বন্দেগী', 'পূর্ববর্তীরা', 'আমল', 'কোরআনে', 'যাদু', 'মাথার','রাসূল','আরবী','সারা','নামাযে','বাসস্থান','প্রত্যাদেশ',
         'ধৈর্য্য','উপাসনা','ধরনের','পয়গাম','রোযা', 'সুলায়মান ', 'দরজা', 'প্রকার', 'পরামর্শ', 'বিয়ে', 'বুকে','তদপেক্ষা','পানির',
         'নহর','চন্দ্রকে','স্তরে','সত্তা','উচ্চারণ','আখেরাতের','আলো','ভুমন্ডলের','চোখের','দ্বীনের','স্থল','একদিন','চেষ্টা','দাতা',
         'অর্থ' ,'সকালে','কথার','সূর্যকে','চোখ','ইয়াকুব','পরকাল','লোকদেরকে','বংশধর','রূহ','গণনা','যালেমদের','আবাসস্থল',
         'কিতাবদের','প্রজ্ঞা','আরম্ভ','মৃতকে','সীমালংঘন','দুনিয়া','খেজুর','পথপ্রদর্শক','বিবাদ','উপায়','মতভেদ','পানপাত্র','অনুসন্ধান',
         'চুক্তি', 'হক','সংশোধন','জীবিকা','রাত্রিকে','ফল-মূল','বিশ্বের','সত্ত্বরই','সাফল্য','আযাবে','প্রতিষ্ঠা','আকাশকে','আসন্ন','বায়ু',
         'বাক্য','চন্দ্র','সতর্কবাণী','যুলুম','সালেহ','কুফরীর','নেয়ামতের','বিজয়','পিতা-মাতার','ভাইয়ের','পরিমাণে' ,'পরবর্তীদের','নীতি',
         'জনৈক','রেশমের','পর্বতের','পাঠের','পূর্বপুরুষদের','কাউকেই','জাহাজ','বাক্যের', 'কিতাবসমূহে','দাদারা','ক্রয়-বিক্রয়',
         'রক্ষণাবেক্ষণকারী','অজ্ঞদের','লাম','ঈমাণদারগণ','ফেরেশতাগণের','রমণীগণ','উদ্যানসমূহে','কৃতজ্ঞের','মিথ্যাচারী','ইবাদত',
         'জীবজন্তু','সিংহাসনের','আত্মা','সেসবই','নিদর্শনসমূহে','বর্ষন','চক্ষুর','প্রতিযোগিতা','এদেরকেই','উদ্যানের','বগলে',
         'সৃষ্টিকারীদেরকে','মুমিনরা','সালেহকে','সাক্ষীদের','আওয়ায','মক্কা,প্রত্যুষে','অনুসারীরা','বণী','মুমিনে','অন্যেরা','বেহেশতের',
         'দরিয়া','দিগন্তে','অত্যাচারীদের','কেফাসাদ','সেজদার','পিঠে','তাঁদেরকে','বংশধরদেরকে','ব্যভিচার','আয়াতের','ঈমানদারদেরকে',
         'কাজই','দু’','বীজ','দ্বীনকে','সতর্ককারীদের','স্রোতধারা','হেকমতওয়ালা','পুত্রকে','ছিদ্র','কর্মফল','শুকরের','ফেরেশতাই',
         'রাখল','দাসের','অপরটির','উপাদান','অশ্বসমূহের','জুলুমকারী','অন্তরসমূহ','বেড়ী','দুনিয়ায়','পুত্র-সন্তান','উক্তির','প্রাপ্তদের',
         'পাখা','মেয়েদের','আল্লাহতে','নূরের','পিঠের','মুখমন্ডলকে','পত্নীগণকে','কৌতুক','তোদের','বাতাসকে','বৃষ্টির','বিয়েরমূক',
         'ফেরেশতাকে','মানুষই','দলীলের','যাদুর','বিবাহে','সিজদা','স্ত্রীও','আমরাই','শক্র','গা','বাহিনীর','অবকাশও','আল্লাহও',
         'মেঘমালার','দৃষ্টান্তসমূহ','মুসলমানের','ভাষা','শিঙ্গায়','যাঁরা','কারীদের','সাবধানীদের','রং','খাঞ্চা','সত্যধর্ম','অহংকারীদেরকে',
         'ব্যবসা','বস্ত্র','অস্বীকারকারী','নেয়ামতে','মাতাকে','অধিবাসীদেরকে','নহরসমূহ','ফল-ফসল','মুসলমানগণ','মুসলমানকে','যুবক',
         'প্রস্রবণসমূহ','মানবে','পর্দার','তাঁকেই','কিতাবকে','অংশীবাদীদের','খেলা','ফলসমূহ','নদীর','সৎকর্মী','বিশ্বপালক','ইহকালের',
         'গোত্রের','মুসাফির','কুফরে','হেদায়াত','স্ত্রীলোক','সম্পাদনকারী','যুগের','বৃষ্টিপাত','উম্মতকে','সুলায়মানকে','ঘরের','সাগরে',
         'সত্তর','ধরা','গরু','যাকারিয়ার','মসজিদুল-হারামের','পুত্রদের','']
  
  VBR  = ['দৌড়াইতেছে','খাইতেছি','যাবো','যাবে', 'খাবো','খাই', 'দৌড়ায়','পড়ে','খেতে','যেতে','খেয়ে','গিয়ে','করি','ঘুমিয়ে','যেয়ে','পড়তে','যায়','বলে',
         'ভালোবাসি','চলে','দেখতে','আসছে','ঘুরতে','যাব','পছন্দ','ঘুমাব','আছে','খেলছে','কাপছে','কাদছে','হও','করছে','করে',
         'ভালোবাসে','আকেঁ','শেখান','শিখি','শিখছে','গাইছে','লিখতে','পারে','লিখে','গাইতে','পারি','খায়','খাচ্ছে','খাচ্ছেন','হয়েছে',
         'আসবে','করবে','করেছেন','খায়','দাও','করলাম','ধরছে','ধরছি','ধরছেন','করছেন','বলেন','করা','থাকি','থাকে','কর',
         'লাগছে','লিখেন','গিয়েছে','লিখছে', 'বসে','আছি','হবে','করবে','করতে','রয়েছে','করেছি','করেন','বলে','করেছে','বলল',
         'হয়ে','করল','করত','হয়','ছিল','হয়েছে','করবেন','করুন','করি','হল','দেয়া','করো','করার','যায়','থাক','দেন','দিয়েছেন',
         'বলুন','করেছিল','নির্দেশ','বললেন','হও','পারবে','দেয়','করেছিলাম','বিচরণ', 'দিত', 'দিতাম', 'পেতে', 'জিজ্ঞাসিত','বাড়িয়ে',
         'প্রবিষ্ট', 'উত্থিত', 'যান', 'প্রদত্ত', 'মেরে', 'এনে', 'নেমে', 'ভয়ে', 'শুনতে', 'হবে', 'আনতে', 'নেয়া', 'বলি', 'বলছ','বিস্মৃত',
         'আন', 'ছড়িয়ে','খাও','দিও','বানিয়ে','করেই','আবদ্ধ','কর','দেখি','এনেছি','দেখান','শুনেন','হন','ছিন্ন','আনবে', 'আনার',
         'উঠে', 'গ্রাস', 'অবর্তীণ', 'নিলেন','থাকুন','হবে','মিলিত','আবৃত','করানো ','দেখেছ','আগত ','গিয়েছিল ','আছি','বহিস্কার',
         'দিতেন','করেছেন','সাড়া','যেয়ো','বৃত্তান্ত','বেরিয়ে ','আদেশে', 'চলতে', 'অবতরণ','নিহত','শুনবে','দিচ্ছেন','পুনরুজ্জীবিত',
         'চাইলে','বলছে','হওয়া' ,'অন্বেষণ' ,'প্রতিহত','নিলাম','শোনেন','নেন', 'নেব', 'নিল', 'নিয়েছেন', 'প্রশংসিত','ছুটে','সমুন্নত',
         'বলেছিল','শোনে','দেখিয়ে','প্রতারণা','আদিষ্ট','হই','দেখুন','উপার্জন','জানত','সাক্ষাত','উদগত','বসবে','পেয়েছি','বরকতময়',
         'হবার','সম্পন্ন','ফেলবে','দেখছি','বোঝ','গেলেন','দেখল','নিন' ,'করেছি','যাওয়া','নির্দেশে','দেখলেন','দিব','বলেছেন',
         'পারতেন','রেখেছে','জানিয়ে','বললাম','গেছে','হচ্ছে','রয়ে','টলে','আর্তনাদ','হটিয়ে','শুনছ','পারো','রেখেছিলাম','কাঁদি',
         'ঢেলে','শুনানো','নির্যাতিত','নির্লিপ্ত','পূনঃ','গ্রস্ত','গ্রহন','ক্রয়-বিক্রয়','ফেটে','বলেছ','অভিহিত','দিলে','বানিও','যাচাই',
         'বর্ষন','থাক','বদ্ধ','বাছাই','পুনঃ','দিয়ো','চলো','সমর্থন','কর-যাতে','গৃহীত','ধোঁকায়','উন্নতি','পড়ত','পদার্পন','ক্ষুধায়',
         'আত্মসংবরণ','যুক্ত','সাধনের','গিলে','জানতেন','জানতো','বরণ','শুনলাম','বুঝিয়ে','লালন-পালন','চেয়েছেন','মরবে','রাখছে',
         'চুকিয়ে','করবার','কাজই','পাঠানো','বুঝিয়েছি','আনছি','টেরও','ভরে','হয়ে','ফেলতে','বিস্মিত','আগমনে','ক্রন্দন','ইঙ্গিত',
         'আসুন','জায়েজ','হাঁকিয়ে','দেখায়','রাখলেন','কিনা','দেখাই','চালায়','গর্ভধারণ','বদলাতে','বর্তাবে','উড়ে','করুন',
         'কাকুতি-মিনতি','শুনিনি','করায়','গেলেও','রওয়ানা','সিজদা','মানত','জেনে-শুনে','কানাকানি','পড়তে','দিয়েছিলে','পৌঁছাই',
         'পাই','উপভোগ','ঘুরতে','পুনরুত্থানের','শায়িত','বলেন-হে','হওয়ারই','ঠেলে','ডেকো','রত','থাকবেন','পৌছাবে','হান',
         'গুটিয়ে','দেখছ','পানাহার','দেখব','করছো','সেবায়','ঢুকে','বিদায়','বোঝার','গিয়েছিলাম','যাচ্ছি','করবেন','মানবে',
         'পরিশোধের','ঘুরিয়ে-ফিরিয়ে','নিও','খেলা','লিখতে','রাখিনি','ফিরত','মিশে','দৌড়াতে','জানবেন','ধিক','করলেই','উঠবে',
         'লঙ্ঘন','জ্ঞানপ্রাপ্ত','গন্য','ভুলিয়ে','ধরা','বুঝবে','অবসান',''] 
  
  ADJ = ['খুব','সুন্দর','ভাল','দ্রুত','সত্য','ধীরে','অসুস্থ','একটি লাল','অনেক','সাহসী','ক্লান্ত','বাইরে','অপেক্ষা','খুশী','শোরগোল',
         'জ্ঞানী','গুনগুন','মনযোগী','বোকা','লম্বা','খাটো','প্রথম','উন্নতি','দশটি','মিথ্যা','পাপ','ক্ষতি','খারাপ','চালাক','ভয়',
         'চিৎকার','পাচঁটি','অতি','একজন','বিশ্বস্ত','উৎকৃষ্ট', ' শুধুমাত্র', 'পরিষ্কার', 'চমৎকার',  'উম্মুক্ত', 'সুদৃঢ়',
         'মজবুত', ' আসল', 'আনন্দিত' ,'সুশোভিত', 'ঠিক', 'অবিশ্বাসী', 'পেশ','অক্ষম','একটি','দুইটি','তিনটি', 'চারটি', 'ছয়টি', 
         'সাতটি','আটটি','নয়টি','আরো', 'পরিপূর্ণ ', 'অশ্লীল', 'সৎকর্মশীলদের', 'দোষ', 'দৃঢ়','দ্বিগুণ', 'সীমালংঘনকারী', 'মঙ্গল',
         'বধির', 'নিরাপদ', 'অমঙ্গল',' সবুজ', 'যন্ত্রনাদায়ক','অভাবমুক্ত','বেখবর','সৎ','দু ','ধৈর্য্যধারণ','অপছন্দ','শক্তিমান','চতুষ্পদ',
         'হ্রাস','কষ্টের','ক্ষমতাবান','সঙ্গত','সংযত','মনগড়া','সৎকর্মশীল','পরহেযগার','দুর্বল','সর্বশক্তিমান','কয়েকজন' ,'উচ্চ',
         'একজনকে','সর্বাধিক','মোটেই','চিন্তাশীল','সহনশীল','মেধাবী','দারুন','সুকৌশলী','গোটা','সারিবদ্ধ','শুষ্ক','এমনভাবে',
         'সাহায্যকারীরূপে','নির্যাতিত','নির্লিপ্ত','পূনঃ','গোছা','ছয়দিনে','ক্ষুদ্র','রক্ষণাবেক্ষণকারী','রসূলরূপে','ক্লিষ্ট','হাঙ্গামা','মিথ্যাচারী',
         'আত্নসমর্পন','মীমাংসাকারী','মর্যাদায়','সীমিত','আস্বাদ','ক্ষুধা','মর্যাদার','প্রশংসাসহ','সর্বদাই','স্থিরীকৃত','দূর্ভোগ','বদ্ধ','নম্র',
         'আলোকিত','অলংকৃত','চিরদিন','হিতাকাঙ্ক্ষী','সুসংহত','অভিযুক্ত','বোধশক্তি','অস্তমিত','বিন্দুমাত্র','বেপরওয়া','মর্যাদাবান',
         'চারটি','ফরজ','সুস্বাদু','উন্নতি','বিকারগ্রস্ত','বণী','প্রাচুর্যময়','অসত্য','আজ্ঞাধীন','গোমরাহীতে','যাক্কুম','আগামী','স্বীয়',
         'পর্যায়ক্রমে','ক্রীড়াচ্ছলে','আয়ত্তাধীন','আত্মসংবরণ','যুক্ত','শুদ্ধ','বোকা','ক্ষোভ','চমৎকৃত','কৃতকার্য','চক্ষুষ্মান','আকার',
         'বাদানুবাদ','পীতবর্ণ','মশগুল','পরিপূর্ণভাবে','বারটি','অতীব','সমুচ্চ','ক্রোধের','পুরাতন','উত্তরাধিকার','আহুত','দু’',
         'বিচরণশীল','ভয়ংকর','ইতিবৃত্ত','প্রাধান্য','কর্মফল','কতকাল','ভ্রান্তিতে','পরন্তু','বলাবাহুল্য','সম্পদশালী','নিভৃতে','বিস্মিত',
         'পরিণামে','অতিশয়','জাহান্নামী','উচ্চে','বিশদভাবে','শাস্তি','অহঙ্কার','মহৎ','নিস্ফল','চক্ষুমান','সম্প্রীতি','যথার্থরূপে',
         'গর্ভধারণ','গুপ্তচর','দুরাচার','পাঁচ','যুদ্ধলব্ধ','ঘনিষ্ঠ','শান্তিতে','মুগ্ধ','সম্ভ্রান্ত','মূক','প্রত্যাবর্তনস্থল','নিয়মানুযায়ী','শৈথিল্য',
         'এং','ভালভাবেই','যাদুর','সুখ','ব্যভিচারী','পূর্বাবস্থায়','তা’','শক্র','মহত্ত্ব','শক্ত','নিঃস্ব','অভিপ্রায়','সুদূর','সুসংবাদবাহী',
         'সংশোধিত','মহাশক্তিশালী','দুঃখে','ভালই','উপকারার্থে','হান','সমাগত','নসীহত','সত্যধর্ম','পচা','পানাহার','দম','বস্ত্র',
         'বিবাদে','উপকৃত','বিনীতভাবে','সীমাতিক্রম','নেক','বিধ্বস্ত','নিপীড়িত','ভীতির','রুগ্ন','সমুদয়','অসীম','পরায়ণ','নীত',
         'সম্পূর্ণরূপে','তালিকাভুক্ত','বস্তুত','স্খলিত','অপমানকর','প্রীতি','নম্রভাবে','সৎকর্মী','পরিমাপ','সদাসর্বদা','লোনা','অচল',
         'হস্তগত','হেদায়াত','পথ-প্রদর্শন','প্রশংসার','আকারে','পুর্ণ','ধিক','কৃতকার্যতা','জ্ঞানপ্রাপ্ত','তেমনিভাবে','দায়-দায়িত্ব','ক্ষতিও',
         'স্বস্তি','পূত-পবিত্র','ক্রমে','ভাবেই','দুর','ব্যাপৃত','']
  
  PV1 = ['খেতে','যেতে','খেয়ে','গিয়ে','ঘুমিয়ে','যেয়ে','পড়তে','ঘুরতে','গাইতে','লিখতে','দেখতে']
  
  PV2 = ['থাকব']
  
  PRE = ['উপরে','এ','মদ্ধে','থেকে','সাথে','এর','পরে','নিচে','আগে','তারপরেয়','বিরুদ্ধে','জন্য','দ্বারা','জন্যে','উপর','মধ্যে',
         'কাছে','প্রতি','ব্যতীত','হতে','বাদ ', 'এরপরও', 'এঁটে ', 'পূর্বেও', 'জন্যই', 'পেছন', 'আগে', 'দিকেই','এরই',
         'পরেই','পিছন','পরও','দ্বারাই','পশ্চাতেও','']
  
  CON = ['কিন্তু','তবু','বিনা','অতএব','অথবা','আর','এবং','কিংবা','ব্যতীত','সুতরাং','নতুবা','তথাপি','তবে','এখনো','বা','না','ও',
         'অতঃপর','কি','যদি','সাথে','অতএব','এ','তো','অথচ','যখন','তখন','যাতে','যেন','এতে','বরং','ছাড়া','তাহলে','তেমনি',
         'তথাপি','তাছাড়া','তখনও','তাও','অর্থাৎ','যত','কিরূপ','যেখানেই','এখনও','তদুপরি','অতপর','সেক্ষেত্রে','কারণেই',
         'সত্ত্বেও','তদীয়','']
  
  CD =['এক','দুই','তিন', 'চার','পাঁচ', 'ছয়', 'সাত','আট','নয়','দশ']
  
  PUNC =['+','-',',',':','"','_','!','/','?','%','#','@','-','*','(',')',
       '{','}','[',']',';','।','.',' ~','^','∑','√','÷','×','∠','∴','≠','--']


  
  a=list(set(tok) & set(PR))
  print('PR/',a)
  if list(set(tok) & set(VBR)):
    b=list(set(tok) & set(VBR))
    #print(b)
    def editDistance(str1, str2, m , n): 
  
        if m==0: 
             return n 
  
        if n==0: 
            return m 
  
 
        if str1[m-1]==str2[n-1]: 
            return editDistance(str1,str2,m-1,n-1) 

        return 1 + min(editDistance(str1, str2, m, n-1),    # Insert 
                     editDistance(str1, str2, m-1, n),    # Remove 
                     editDistance(str1, str2, m-1, n-1)    # Replace 
                     ) 
  



    VB  = ['খাই','দৌড়ায়','পড়ে','গিয়ে','করি','ঘুম','বলে','চলে','আসছে','ঘুরতে','যাব','পছন্দ','আছে','খেলা','কাপছে'] 
    
    substring = ['তেছি','ছিল','তেছে','ছিলাম'] 

    fullstring = tok #i input from here
    print(fullstring)
    
    index1=-1
    for i in substring:
    
        index1=index1+1
        if i in fullstring:
       
            #print(index1)
            Y= fullstring.split(substring[index1])[0]
            print("Input:",fullstring )
            print("Root word: ",Y)
        
#-----------------
    kk=[]
    for index in range(len(VB)): 
    
       k=editDistance(Y, VB[index], len(Y), len(VB[index])) 
       print("Distance: ",k)

       kk.append(k)
    
    
    for i in range (len(kk)):
      #print(kk[i])
    
       smallest = min(kk)
     # l.index(min(l))
       
    

    print("lowest distance: ",smallest)

   
    print("Closest word with lowest distance value :",VB[kk.index(min(kk))])
        

  print('VB/',b)

  c=list(set(tok) & set(OB))
  print('OB/',c)
  d=list(set(tok) & set(ADJ))
  
  e=list(set(tok) & set(PRE)) 
  print('PRE/',e)
  
  f=list(set(tok) & set(CON)) 
  print('CON/',f)
  p=list(set(tok) & set(PUNC)) 
  print('PUNC/',p)
  g=list(set(tok) & set(CD)) 
  print('CD/',g)
  
  adverb=[]

  
 
  print('All:',tok)
  PB=[]
  my_arr=[]
  NN=[]
  
  for item in tok:
    if item in adverb:
      my_arr.append("ADV") 
    elif item in a:
      my_arr.append("PR")
    elif item in PV1:
      my_arr.append("VB1")  
    elif item in PV2:
      my_arr.append("VB2") 
    elif item in b:
      my_arr.append("VB")
    elif item in c:
      my_arr.append("OB")
    elif item in d:
      my_arr.append("ADJ")
    elif item in e:
      my_arr.append("PRE")   
    elif item in f:
      my_arr.append("CON") 
    elif item in p:
      my_arr.append("PUNC") 
    elif item in g:
      my_arr.append("CD") 
    else:
      my_arr.append("NN")
    


  print('My desired thing is:#',my_arr)
  #for index in (1,len(my_arr)-1):
      
  for index in  range(len(my_arr)):  
    if(my_arr[index]=='VB'and my_arr[index-1]=='ADJ' ):
        my_arr[index-1]="ADV" 

      
  for n in  reversed(range(len(my_arr))): 
    if(my_arr[n]=='ADJ'and my_arr[n-1]=='ADJ'):
       my_arr[n-1]="ADV" 
       my_arr[n]="ADJ"   
  for m in  range(len(my_arr)):
    if(my_arr[m]=='VB2'and my_arr[m-1]=='VB1'):
      my_arr[m-1]="PV"
      del my_arr[m]
    elif ((my_arr[m]!='VB2'and my_arr[m-1]=='VB1') or (my_arr[m]=='VB2'and my_arr[m-1]!='VB1')):
           my_arr[m]="VB"
           my_arr[m-1]="VB"
      
    
  for o in range(len(my_arr)):
    if(my_arr[o] == 'OB'):
       my_arr[o]="NN"
 
        
  for i in reversed(range(len(my_arr))):   
      if(my_arr[i]=='ADV' and my_arr[i-1] =='ADJ'):
        my_arr[i-1]="ADV"
       
      
 
          
  print('#Let\'s see',my_arr)  
  #print('NN/',a)
  #print('VB/',b)
  #print('OB/',c)
  #print('modified adverb: ',adverb)
  #print('modified adjective: ',adjective)
 
  end=time.time()
  
  print('Time taken: ',end-start)
  
  print("\n")
    